In [3]:
import pandas as pd

data = pd.read_csv('employees.csv' , sep = ':')
# sep = , as it is seperated my columns
print(data)

    id         name   age             specialization
0    2        shine   NaN              data engineer
1    3     kunjacks  22.0                        NaN
2    4        sisly  32.0          flutter developer
3    1        jonny  77.0          flutter developer
4    5       daveed   NaN               data science
5    6        lilly  18.0                        NaN
6    9  thomaskutty   NaN          flutter developer
7    8         mary  37.0                        NaN
8    7        eesha  21.0               data science
9   11        neena  38.0          flutter developer
10  18  georgekutty   NaN               data science
11  20     shoshama  27.0          flutter developer
12  21       nithin  20.0  python mobile development

C:\Users\shaha\AppData\Local\Temp\ipykernel_17960\3302763978.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [4]:
data1 = pd.read_csv('employees.csv' , sep = ':' , header = 2)
print(data1)

     3     kunjacks    22                 Unnamed: 3
0    4        sisly  32.0          flutter developer
1    1        jonny  77.0          flutter developer
2    5       daveed   NaN               data science
3    6        lilly  18.0                        NaN
4    9  thomaskutty   NaN          flutter developer
5    8         mary  37.0                        NaN
6    7        eesha  21.0               data science
7   11        neena  38.0          flutter developer
8   18  georgekutty   NaN               data science
9   20     shoshama  27.0          flutter developer
10  21       nithin  20.0  python mobile development

In [5]:
data1 = pd.read_csv('employees.csv' , sep = ':' , skiprows= 4, na_values=['  '] , keep_default_na=False)
# skiprows for skipping some rows 
# na_values = something and keep_default_na = False sets the NaN values to be not shown during display 
print(data1)

    1        jonny  77          flutter developer
0   5       daveed                   data science
1   6        lilly  18
2   9  thomaskutty              flutter developer
3   8         mary  37
4   7        eesha  21               data science
5  11        neena  38          flutter developer
6  18  georgekutty                   data science
7  20     shoshama  27          flutter developer
8  21       nithin  20  python mobile development

In [6]:
data1 = pd.read_csv('employees.csv' , sep = ':' , usecols = ['id' , 'age'])
print(data1)
#specifying the only columns that needs to be displayed
data1 = pd.read_csv('employees.csv' , sep = ':' , usecols = [1])
print(data1)
#using indexes

    id   age
0    2   NaN
1    3  22.0
2    4  32.0
3    1  77.0
4    5   NaN
5    6  18.0
6    9   NaN
7    8  37.0
8    7  21.0
9   11  38.0
10  18   NaN
11  20  27.0
12  21  20.0
           name
0         shine
1      kunjacks
2         sisly
3         jonny
4        daveed
5         lilly
6   thomaskutty
7          mary
8         eesha
9         neena
10  georgekutty
11     shoshama
12       nithin

In [7]:
#when there are large csv files , we can display easily by classifying to chunks ie tables of chunk size

iter = pd.read_csv('employees.csv' , sep = ':' , chunksize = 3)
#for this we have to iterate so creates tables with row size 3
for x in iter:
    print(x)

   id      name   age     specialization
0   2     shine   NaN      data engineer
1   3  kunjacks  22.0                NaN
2   4     sisly  32.0  flutter developer
   id    name   age     specialization
3   1   jonny  77.0  flutter developer
4   5  daveed   NaN       data science
5   6   lilly  18.0                NaN
   id         name   age     specialization
6   9  thomaskutty   NaN  flutter developer
7   8         mary  37.0                NaN
8   7        eesha  21.0       data science
    id         name   age     specialization
9   11        neena  38.0  flutter developer
10  18  georgekutty   NaN       data science
11  20     shoshama  27.0  flutter developer
    id    name  age             specialization
12  21  nithin   20  python mobile development

In [8]:
df1 = pd.read_csv('employees.csv' , sep = ':')
from sklearn.model_selection import train_test_split 
x,y = train_test_split(df1,test_size=0.3,random_state=0)
# x,y = df1.iloc[0:df1.shape[0]//2],df1.iloc[df1.shape[0]//2:]

In [9]:
x

    id      name   age             specialization
2    4     sisly  32.0          flutter developer
8    7     eesha  21.0               data science
1    3  kunjacks  22.0                        NaN
7    8      mary  37.0                        NaN
9   11     neena  38.0          flutter developer
3    1     jonny  77.0          flutter developer
0    2     shine   NaN              data engineer
5    6     lilly  18.0                        NaN
12  21    nithin  20.0  python mobile development

In [10]:
y

    id         name   age     specialization
6    9  thomaskutty   NaN  flutter developer
11  20     shoshama  27.0  flutter developer
4    5       daveed   NaN       data science
10  18  georgekutty   NaN       data science